app/views/admin/jobs/index.html.erb

    </td>
    <td> <%= link_to(job.resumes.count, admin_job_resumes_path(job)) %> </td>
---
SELECT COUNT(*) FROM "resumes" WHERE "resumes"."job_id" = ?  [["job_id", 1]]